Revit 2027 API
ConnectionInputPointInfo.PointSelectionText Property
 A string used to select input point by some connections.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string PointSelectionText { get; set; }
Public Property PointSelectionText As String
	Get
	Set
public:
property String^ PointSelectionText {
	String^ get ();
	void set (String^ value);
}
member PointSelectionText : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ConnectionInputPointInfo Class
Autodesk.Revit.DB.Structure Namespace